perf/results/sleep/node_spike_output.txt
> artillery "run" "./scenarios/sleep_spike.yaml" "-e" "node"

Started phase 0 (Plain), duration: 20s @ 10:25:15(-0300) 2020-11-11
Report @ 10:25:25(-0300) 2020-11-11
Elapsed time: 10 seconds
  Scenarios launched:  0
  Scenarios completed: 0
  Requests completed:  0
  Mean response/sec: NaN
  Response time (msec):
    min: NaN
    max: NaN
    median: NaN
    p95: NaN
    p99: NaN

Report @ 10:25:35(-0300) 2020-11-11
Elapsed time: 20 seconds
  Scenarios launched:  0
  Scenarios completed: 0
  Requests completed:  0
  Mean response/sec: NaN
  Response time (msec):
    min: NaN
    max: NaN
    median: NaN
    p95: NaN
    p99: NaN

Started phase 1 (Plain), duration: 20s @ 10:25:35(-0300) 2020-11-11
Report @ 10:25:45(-0300) 2020-11-11
Elapsed time: 30 seconds
  Scenarios launched:  99
  Scenarios completed: 69
  Requests completed:  69
  Mean response/sec: 10.07
  Response time (msec):
    min: 3002.4
    max: 3038
    median: 3004.2
    p95: 3006.2
    p99: 3034.2
  Codes:
    200: 69

Report @ 10:25:55(-0300) 2020-11-11
Elapsed time: 40 seconds
  Scenarios launched:  100
  Scenarios completed: 100
  Requests completed:  100
  Mean response/sec: 10.02
  Response time (msec):
    min: 3001.4
    max: 3035.2
    median: 3003.9
    p95: 3006.4
    p99: 3021.6
  Codes:
    200: 100

Started phase 2 (Spike Up 1), duration: 10s @ 10:25:55(-0300) 2020-11-11
Report @ 10:26:05(-0300) 2020-11-11
Elapsed time: 50 seconds
  Scenarios launched:  897
  Scenarios completed: 488
  Requests completed:  488
  Mean response/sec: 89.6
  Response time (msec):
    min: 3000.4
    max: 3027.6
    median: 3002.6
    p95: 3007.5
    p99: 3012.5
  Codes:
    200: 488

Started phase 3 (Plain 1), duration: 10s @ 10:26:05(-0300) 2020-11-11
Report @ 10:26:15(-0300) 2020-11-11
Elapsed time: 1 minute, 0 seconds
  Scenarios launched:  1697
  Scenarios completed: 1621
  Requests completed:  1621
  Mean response/sec: 169.8
  Response time (msec):
    min: 3000.2
    max: 3029.9
    median: 3001.4
    p95: 3003.7
    p99: 3008.6
  Codes:
    200: 1621
  Errors:
    ECONNRESET: 6

Started phase 4 (Spike Down 1), duration: 10s @ 10:26:15(-0300) 2020-11-11
Report @ 10:26:25(-0300) 2020-11-11
Elapsed time: 1 minute, 10 seconds
  Scenarios launched:  1005
  Scenarios completed: 1364
  Requests completed:  1364
  Mean response/sec: 100.4
  Response time (msec):
    min: 3000.4
    max: 3018.9
    median: 3002.3
    p95: 3006
    p99: 3009.5
  Codes:
    200: 1364

Started phase 5 (Plain), duration: 20s @ 10:26:25(-0300) 2020-11-11
Report @ 10:26:35(-0300) 2020-11-11
Elapsed time: 1 minute, 20 seconds
  Scenarios launched:  103
  Scenarios completed: 223
  Requests completed:  223
  Mean response/sec: 10.35
  Response time (msec):
    min: 3000.9
    max: 3043.7
    median: 3003.2
    p95: 3007.6
    p99: 3015.3
  Codes:
    200: 223

Report @ 10:26:45(-0300) 2020-11-11
Elapsed time: 1 minute, 30 seconds
  Scenarios launched:  100
  Scenarios completed: 100
  Requests completed:  100
  Mean response/sec: 10.05
  Response time (msec):
    min: 3000.8
    max: 3009.9
    median: 3003.2
    p95: 3004.8
    p99: 3009.8
  Codes:
    200: 100

Started phase 6 (Spike Up 2), duration: 10s @ 10:26:45(-0300) 2020-11-11
Report @ 10:26:55(-0300) 2020-11-11
Elapsed time: 1 minute, 40 seconds
  Scenarios launched:  746
  Scenarios completed: 404
  Requests completed:  404
  Mean response/sec: 74.72
  Response time (msec):
    min: 3000.6
    max: 3013.5
    median: 3002.9
    p95: 3007.2
    p99: 3010.4
  Codes:
    200: 404

Started phase 7 (Plain 2), duration: 10s @ 10:26:56(-0300) 2020-11-11
Report @ 10:27:05(-0300) 2020-11-11
Elapsed time: 1 minute, 50 seconds
  Scenarios launched:  1686
  Scenarios completed: 1546
  Requests completed:  1546
  Mean response/sec: 168.87
  Response time (msec):
    min: 3000.2
    max: 3016.2
    median: 3001.3
    p95: 3004.3
    p99: 3008.1
  Codes:
    200: 1546
  Errors:
    ECONNRESET: 2

Report @ 10:27:15(-0300) 2020-11-11
Elapsed time: 2 minutes, 0 seconds
  Scenarios launched:  1145
  Scenarios completed: 1474
  Requests completed:  1474
  Mean response/sec: 114.39
  Response time (msec):
    min: 3000.2
    max: 3014.1
    median: 3002.3
    p95: 3006.2
    p99: 3009.8
  Codes:
    200: 1474
  Errors:
    ECONNRESET: 1

Started phase 9 (Plain), duration: 20s @ 10:27:16(-0300) 2020-11-11
Report @ 10:27:25(-0300) 2020-11-11
Elapsed time: 2 minutes, 10 seconds
  Scenarios launched:  48
  Scenarios completed: 228
  Requests completed:  228
  Mean response/sec: 4.81
  Response time (msec):
    min: 3001
    max: 3035.7
    median: 3003.9
    p95: 3009
    p99: 3017
  Codes:
    200: 228

Report @ 10:27:35(-0300) 2020-11-11
Elapsed time: 2 minutes, 20 seconds
  Scenarios launched:  0
  Scenarios completed: 0
  Requests completed:  0
  Mean response/sec: NaN
  Response time (msec):
    min: NaN
    max: NaN
    median: NaN
    p95: NaN
    p99: NaN

Report @ 10:27:37(-0300) 2020-11-11
Elapsed time: 2 minutes, 22 seconds
  Scenarios launched:  0
  Scenarios completed: 0
  Requests completed:  0
  Mean response/sec: NaN
  Response time (msec):
    min: NaN
    max: NaN
    median: NaN
    p95: NaN
    p99: NaN

All virtual users finished
Summary report @ 10:27:37(-0300) 2020-11-11
  Scenarios launched:  7626
  Scenarios completed: 7617
  Requests completed:  7617
  Mean response/sec: 62.47
  Response time (msec):
    min: 3000.2
    max: 3043.7
    median: 3002
    p95: 3006
    p99: 3009.7
  Scenario counts:
    Sleep (/sleep): 7626 (100%)
  Codes:
    200: 7617
  Errors:
    ECONNRESET: 9